<a href="https://colab.research.google.com/github/Edivaldo16/python_analise_panda/blob/main/Python_analise_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Python para análise de dados (panda) - *Edivaldo Júnior*

In [ ]:
#Importando Biblioteca Pandas
import pandas as pd

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Datasets/teste.csv",error_bad_lines=False)

In [26]:
# Visualizando as "5" primeiras linhas 'variável'.head

df.head()

   Salgadinho   Umidade    Salinidade
0          10         20           30
1          40         50           60
2          70         80           90
3         100        200          300
4         500       1000         2000

In [27]:
# Visualizando sem as ";"

df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Datasets/teste.csv",error_bad_lines=False, sep = ";")
df.head()

   Temperatura   Umidade    Salinidade
0           10         20           30
1           40         50           60
2           70         80           90
3          100        200          300
4          500       1000         2000

In [28]:
# Renomeando Colunas

df.rename(columns={"Temperatura":"Salgadinho", "Umidade":"Docinho", "Salinidade":"SwingTrade"}) # Por que não altera as outras duas colunas???

   Salgadinho   Umidade    Salinidade
0          10         20           30
1          40         50           60
2          70         80           90
3         100        200          300
4         500       1000         2000
5         800        857          986
6         879        587          698

In [30]:
# Saída de determinada quantidade de linhas com o comando 'variável'.head(n), em que "n" é o número de linhas

df.head(10)

   Temperatura   Umidade    Salinidade
0           10         20           30
1           40         50           60
2           70         80           90
3          100        200          300
4          500       1000         2000
5          800        857          986
6          879        587          698

In [31]:
# Comando para total de linhas e colunas 'variável'.shape

df.shape

(7, 3)

In [33]:
# Verificar o título de cada coluna 'variável'.columns

df.columns

Index(['Temperatura', ' Umidade ', ' Salinidade'], dtype='object')

In [34]:
# Verificar o tipo de dado de cada coluna 'variável'.dtypes

df.dtypes

Temperatura    int64
 Umidade       int64
 Salinidade    int64
dtype: object

In [35]:
# Visualizando as "5" últimas linhas 'variável'.tail

df.tail()

   Temperatura   Umidade    Salinidade
2           70         80           90
3          100        200          300
4          500       1000         2000
5          800        857          986
6          879        587          698

In [36]:
# Retornando informações estatísticas 'variável'.describe()

df.describe()

       Temperatura     Umidade    Salinidade
count     7.000000     7.000000     7.000000
mean    342.714286   399.142857   594.857143
std     377.948283   410.916224   717.055885
min      10.000000    20.000000    30.000000
25%      55.000000    65.000000    75.000000
50%     100.000000   200.000000   300.000000
75%     650.000000   722.000000   842.000000
max     879.000000  1000.000000  2000.000000

In [37]:
# Filtros - 'variável'["nome da coluna"].unique()

df["Temperatura"].unique()

array([ 10,  40,  70, 100, 500, 800, 879])

In [39]:
# Alocando dados de uma coluna em uma variável

Carlos = df.loc[df["Temperatura"] == 100]
Carlos.head()

   Temperatura   Umidade    Salinidade
3          100        200          300

In [40]:
Carlos["Temperatura"].unique()

array([100])

In [ ]:
# Agrupamento de dados - 'variável'.groupby("coluna")["coluna"].nunique()

df
df.groupby("Salinidade")["Temperatura"].nunique() # Tenho algumas dúvidas. Não entendi muito bem.
df.groupby("Salinidade")["Temperatura"].mean() # Faz uma média

In [46]:
# Média uma Coluna 'variável'["coluna"].mean()

df["Temperatura"].mean()

342.7142857142857

In [48]:
# Soma total uma Coluna 'variável'["coluna"].sum()

df["Temperatura"].sum()

2399